Revit 2027 API
ParameterTypeId.StairstypeConstructionMethod Property
 "Construction Method":
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeConstructionMethod { get; }
Public Shared ReadOnly Property StairstypeConstructionMethod As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeConstructionMethod {
	ForgeTypeId^ get ();
}
static member StairstypeConstructionMethod : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace